____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
zeropadding2d_1 (ZeroPadding2D)  (None, 100, 84, 1)    0           zeropadding2d_input_1[0][0]      
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 98, 82, 16)    160         zeropadding2d_1[0][0]            
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 98, 82, 16)    0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 49, 41, 16)    0           activation_1[0][0]               
____________________________________________________________________________________________________
zeropadding2d_2 (ZeroPadding2D)  (None, 51, 43, 16)    0           maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 49, 41, 16)    2320        zeropadding2d_2[0][0]            
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 49, 41, 16)    0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 24, 20, 16)    0           activation_2[0][0]               
____________________________________________________________________________________________________
zeropadding2d_3 (ZeroPadding2D)  (None, 26, 22, 16)    0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 24, 20, 16)    2320        zeropadding2d_3[0][0]            
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 24, 20, 16)    0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 12, 10, 16)    0           activation_3[0][0]               
____________________________________________________________________________________________________
zeropadding2d_4 (ZeroPadding2D)  (None, 14, 12, 16)    0           maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 12, 10, 16)    2320        zeropadding2d_4[0][0]            
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 12, 10, 16)    0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
maxpooling2d_4 (MaxPooling2D)    (None, 6, 5, 16)      0           activation_4[0][0]               
____________________________________________________________________________________________________
zeropadding2d_5 (ZeroPadding2D)  (None, 8, 7, 16)      0           maxpooling2d_4[0][0]             
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 6, 5, 16)      2320        zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 6, 5, 16)      0           convolution2d_5[0][0]            
____________________________________________________________________________________________________
maxpooling2d_5 (MaxPooling2D)    (None, 3, 2, 16)      0           activation_5[0][0]               
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 96)            0           maxpooling2d_5[0][0]             
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 1)             97          flatten_1[0][0]                  
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 1)             0           dense_1[0][0]                    
====================================================================================================
Total params: 9,537
Trainable params: 9,537
Non-trainable params: 0
____________________________________________________________________________________________________
